---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Element Properties
Element Class See Also Send Feedback
---

The Element type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | AssemblyInstanceId | The id of the assembly instance to which the element belongs. |
|  | BoundingBox | Retrieves a box that circumscribes all geometry of the element. |
|  | Category | Retrieves a Category object that represents the category or sub category in which the element resides. |
|  | CreatedPhaseId | Id of a Phase at which the Element was created. |
|  | DemolishedPhaseId | Id of a Phase at which the Element was demolished. |
|  | DesignOption | Returns the design option to which the element belongs. |
|  | Document | Returns the Document in which the Element resides. |
|  | Geometry | Retrieves the geometric representation of the element. |
|  | GroupId | The id of the group to which an element belongs. |
|  | Id | A unique identifier for an Element in an Autodesk Revit project. |
|  | IsModifiable | Identifies if the element is modifiable. |
|  | IsTransient | Indicates whether an element is transient or permanent. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LevelId | The id of the level associated with the element. |
|  | Location | This property is used to find the physical location of an element within a project. |
|  | Name | A human readable name for the Element. |
|  | OwnerViewId | The id of the view that owns the element. |
|  | [Parameter[([( Guid])]) ](2e852bc4-46c6-5598-cc45-0eaf38cf8973.md) | Retrieves a parameter from the element given a GUID for a shared parameter. |
|  | [Parameter[([( BuiltInParameter])]) ](2f91a9f3-7f69-72f9-08d6-a2d71dfb33db.md) | Retrieves a parameter from the element given a parameter id. |
|  | [Parameter[([( Definition])]) ](87d8a88c-906e-85a9-f575-f263788b8584.md) | Retrieves a parameter from the element based on its definition. |
|  | Parameters | Retrieves a set containing all of the parameters that are contained within the element. |
|  | ParametersMap | Retrieves a map containing all of the parameters that are contained within the element. |
|  | Pinned | Identifies if the element has been pinned to prevent changes. |
|  | UniqueId | A stable unique identifier for an element within the document. |
|  | VersionGuid | Get the element version Guid. |
|  | ViewSpecific | Identifies if the element is owned by a view. |
|  | WorksetId | Get Id of the Workset which owns the element. |

# See Also

Element Class

Autodesk.Revit.DB Namespace